# SymbolicCurveArray Properties

---
The SymbolicCurveArray type exposes the following members.
| Name| Description
---|---|---
| IsEmpty| Test to see if the array is empty.
| IsReadOnly| Identifies if the object is read-only or modifiable.(Inherited from APIObject)
| Item| Gets or sets a model curve at a specified index within the array.
| Size| Returns the number of model curves that are in the array.
Top
#### Reference
SymbolicCurveArray Class
Autodesk.Revit.DB Namespace